Autodesk.Revit.CurveAPIUtils.CreateHermiteSpline(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.HermiteSplineTangents)
Creates a Hermite spline with specified tangency at its endpoints.
controlPoints:
The control points of the Hermite spline.
periodic:
True if the Hermite spline is to be periodic, false otherwise.
tangents:
The object which indicates tangency at the start, the end, or both ends of the curve.
Returns:
The new HermiteSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The control points array is invalid, because it doesn't contain the minimum number of points (2).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to construct valid HermiteSpline from given inputs.
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateHermiteSpline(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean)
Creates a Hermite spline with default tangency at its endpoints.
Remarks:
The tangents at the ends of the spline are computed from the control points.
controlPoints:
The control points of the Hermite spline.
periodic:
True if the Hermite spline is to be periodic, false otherwise.
Returns:
The new HermiteSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The control points array is invalid, because it doesn't contain the minimum number of points (2).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to construct valid HermiteSpline from given inputs.
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateNurbSpline(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{System.Double})
Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Remarks:
Knots and degree of the spline are computed from the control points and weights.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The control points array must contain at least 4 points.
-or-
The weights array must be the same size as the control points array.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateNurbSpline(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{System.Double},System.Collections.Generic.IList`1{System.Double},System.Int32,System.Boolean,System.Boolean)
Creates a new geometric NURBSpline object.
Remarks:
Degree must be 3 or greater.  If rational, the control points and weights array must be the same size.
There must be at least degree+1 control points.
The size of knots must equal the sum of degree, the size of the controlPoints array and 1. The first
degree+1 knots should be identical, as should the last degree+1 knots.
The knots in the middle of the sequence must be non-decreasing.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
knots:
The knots of the NURBSpline.
degree:
The degree of the NURBSpline.
closed:
True if the NURBSpline should be closed, false otherwise.
rational:
True if the NURBSpline is rational, false if it is irrational.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Degree must be >= 3.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
For a rational NurbSpline, the weights array must be the same size as the control points array.
-or-
The control points array must contain at least degree + 1 points, and if closed,
the first and last points in the control points array must be identical.
-or-
The size of knots must equal the sum of degree, the size of the controlPoints array and 1. The first
degree+1 knots should be identical, as should the last degree+1 knots.
The knots in the middle of the sequence must be non-decreasing.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateEllipse(Autodesk.Revit.DB.XYZ,System.Double,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,System.Double)
Creates a new geometric ellipse or elliptical arc object.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded ellipse.
center:
The center.
xRadius:
The x vector radius of the ellipse.
yRadius:
The y vector radius of the ellipse.
xAxis:
The x axis to define the ellipse plane.  Must be normalized.
yAxis:
The y axis to define the ellipse plane.   Must be normalized.
startParameter:
The raw parameter value at the start of the ellipse.
endParameter:
The raw parameter value at the end of the ellipse.
Returns:
The new ellipse or elliptical arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for xRadius must be greater than 0 and no more than 30000 feet.
-or-
The given value for yRadius must be greater than 0 and no more than 30000 feet.
-or-
xAxis is not length 1.0.
-or-
yAxis is not length 1.0.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors xAxis and yAxis are not perpendicular.
-or-
Start parameter must be less than end parameter.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.GetCurveEndParameter(Autodesk.Revit.DB.Curve,System.Int32)
Returns the raw parameter value at the start or end of this curve.
curve:
The curve.
index:
0 for the start or 1 for end of the curve.
Returns:
The parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
index must be 0 for the start of the curve or 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014